Обработки/Reports/_РеестрКвалифицированныхИнвесторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РеестрКвалифицированныхИнвесторов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КвалифицированныйИнвестор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РеестрКвалифицированныхИнвесторов/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Реестр квалифицированных инвесторов",
		"0.2",
		"",
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект);
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	СессияСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСбораСтатистики.Хранилище, ПараметрыСбораСтатистики.Описание);
	
	
	Запрос = Новый Запрос;	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Дата", 						КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("Организация", 				ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("КвалифицированныйИнвестор", 	ЭтотОбъект.КвалифицированныйИнвестор);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОснованияВнесенияВПеречень.Объект КАК КвалИнвестор,
		|	ОснованияВнесенияВПеречень.Основание КАК Основание,
		|	ОснованияВнесенияВПеречень.Период КАК Период
		|ПОМЕСТИТЬ _Основания
		|ИЗ
		|	РегистрСведений.ОснованияВнесенияВПеречень КАК ОснованияВнесенияВПеречень
		|ГДЕ
		|	ОснованияВнесенияВПеречень.ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.КвалифицированныеИнвесторы)
		|	И ОснованияВнесенияВПеречень.Организация = &Организация
		|	И ОснованияВнесенияВПеречень.Период <= &Дата
		|	И &ОтборПоКвалИнвестору
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.ВидАктива КАК ВидАктива,
		|	_Основания.КвалИнвестор КАК КвалИнвестор,
		|	_Основания.Основание КАК Основание,
		|	_Основания.Период КАК ДатаВнесенияЗаписи,
		|	ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка.ВидИзменения КАК ВидИзменения,
		|	ВЫБОР
		|		КОГДА ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка.ВидИзменения = ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Исключение)
		|			ТОГДА ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка.ПричинаИсключенияКвалифицированногоЛица
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК ПричинаИсключения,
		|	ВЫБОР
		|		КОГДА ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка.ВидИзменения = ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Исключение)
		|			ТОГДА _Основания.Период
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК ДатаИсключения
		|ПОМЕСТИТЬ _ИсторияРеестра
		|ИЗ
		|	_Основания КАК _Основания
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнесениеИзмененийВоВнутреннийПеречень.ВидыАктивовКвалифицированныхИнвесторов КАК ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов
		|		ПО _Основания.Основание = ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.Ссылка
		|ГДЕ
		|	НЕ ВнесениеИзмененийВоВнутреннийПереченьВидыАктивовКвалифицированныхИнвесторов.ВидАктива ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	_ИсторияРеестра.КвалИнвестор КАК КвалИнвестор,
		|	_ИсторияРеестра.ДатаВнесенияЗаписи КАК ДатаВнесенияЗаписи
		|ПОМЕСТИТЬ _ДатыИзменения
		|ИЗ
		|	_ИсторияРеестра КАК _ИсторияРеестра
		|ГДЕ
		|	_ИсторияРеестра.ВидИзменения = ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Изменение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу КАК Организация
		|ПОМЕСТИТЬ _ДанныеОрганизации
		|ИЗ
		|	(ВЫБРАТЬ
		|		Организации.ЮрФизЛицо КАК ЮрФизЛицо
		|	ИЗ
		|		Справочник.Организации КАК Организации
		|	ГДЕ
		|		Организации.Ссылка = &Организация) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО ВложенныйЗапрос.ЮрФизЛицо = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.КвалИнвестор КАК КвалИнвестор,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.КвалИнвестор.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество
		|		ИНАЧЕ РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу + "", "" + РеквизитыЮридическихЛицАнкетныеСрезПоследних.КраткоеНаименованиеПоУставу
		|	КОНЕЦ КАК Наименование,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.КвалИнвестор.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.АдресРегистрации
		|		ИНАЧЕ РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮридическийАдрес
		|	КОНЕЦ КАК Адрес,
		|	ВЫБОР
		|		КОГДА ВложенныйЗапрос.КвалИнвестор.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|			ТОГДА РеквизитыФизическихЛицАнкетныеСрезПоследних.ВидУдостоверенияЛичности.Наименование + "" №"" + РеквизитыФизическихЛицАнкетныеСрезПоследних.СерияУдостоверенияЛичности + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.НомерУдостоверенияЛичности
		|		ИНАЧЕ ВЫБОР
		|				КОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.СтранаРегистрации В (ЗНАЧЕНИЕ(Справочник.СтраныМира.), ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
		|					ТОГДА РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН
		|				ИНАЧЕ РеквизитыЮридическихЛицАнкетныеСрезПоследних.TIN
		|			КОНЕЦ
		|	КОНЕЦ КАК Документ
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		_Основания.КвалИнвестор КАК КвалИнвестор
		|	ИЗ
		|		_Основания КАК _Основания) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ПО ВложенныйЗапрос.КвалИнвестор = РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Дата,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ПО ВложенныйЗапрос.КвалИнвестор = РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ОтборПоКвалИнвестору", ?(ЗначениеЗаполнено(ЭтотОбъект.КвалифицированныйИнвестор), "ОснованияВнесенияВПеречень.Объект = &КвалифицированныйИнвестор", "ИСТИНА"));
	
	Выборка 		= Запрос.Выполнить().Выбрать();
	
	ДанныеОрганизации = Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеОрганизации"].ПолучитьДанные().Выгрузить();
	
	Если ДанныеОрганизации.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных по организации");
		Возврат;
	КонецЕсли;
	
	ИсторияРеестра 	= Запрос.МенеджерВременныхТаблиц.Таблицы["_ИсторияРеестра"].ПолучитьДанные().Выгрузить();
	ИсторияРеестра.Сортировать("КвалИнвестор,ВидИзменения,ДатаВнесенияЗаписи");
	ДатыИзменения 	= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДатыИзменения"].ПолучитьДанные().Выгрузить();
	ДатыИзменения.Сортировать("КвалИнвестор,ДатаВнесенияЗаписи");
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьШапка.Параметры.Заполнить(ДанныеОрганизации[0]);
	ОбластьШапка.Параметры.Дата = Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy");

	ДокументРезультат.Вывести(ОбластьШапка);
	
	НомерСтроки = 1;
	Пока Выборка.Следующий() Цикл
				
		СтрокиВключения = ИсторияРеестра.НайтиСтроки(Новый Структура("КвалИнвестор, ВидИзменения", Выборка.КвалИнвестор, Перечисления.ВидыИзмененийПеречней.Включение));
		
		ВидыАктивов = Новый Массив;
		Для Каждого СтрокаВключения Из СтрокиВключения Цикл
			ВидыАктивов.Добавить(СтрокаВключения.ВидАктива);
		КонецЦикла;
		
		ВывестиСтроку(ДокументРезультат, ОбластьСтрока, Выборка, СтрокиВключения[0], ВидыАктивов, НомерСтроки);
		
		// Изменений может быть много, нужно пройтись по каждой дате и вывести только строки с измененным составом активов		
		ДатыИзмененияРеестра = ДатыИзменения.НайтиСтроки(Новый Структура("КвалИнвестор", Выборка.КвалИнвестор));
		
		Для Каждого СтрокаДаты Из ДатыИзмененияРеестра Цикл
			
			СтрокиИзменения = ИсторияРеестра.НайтиСтроки(Новый Структура("КвалИнвестор, ДатаВнесенияЗаписи, ВидИзменения", Выборка.КвалИнвестор, СтрокаДаты.ДатаВнесенияЗаписи, Перечисления.ВидыИзмененийПеречней.Изменение));
			
			ВидыАктивовИзменения = Новый Массив;
			Для Каждого СтрокаИзменения Из СтрокиИзменения Цикл
				ВидыАктивовИзменения.Добавить(СтрокаИзменения.ВидАктива);
			КонецЦикла;
			
			СтруктураИзменений = Документы.ВнесениеИзмененийВоВнутреннийПеречень.СформироватьСтруктуруИзмененийСоставаВидовАктивов(ВидыАктивов, ВидыАктивовИзменения);
			
			Если СтруктураИзменений.ДобавленныеВидыАктивов.Количество() = 0 И СтруктураИзменений.УдаленныеВидыАктивов.Количество() = 0 Тогда
				// Изменения видов активов нет, поэтому не нужно выводить в реестр
				Продолжить;
			КонецЕсли;
			
			ВывестиСтроку(ДокументРезультат, ОбластьСтрока, Выборка, СтрокиИзменения[0], ВидыАктивовИзменения, НомерСтроки);
			
			ВидыАктивов.Очистить();;
			Для Каждого ВидАктива Из ВидыАктивовИзменения Цикл
				ВидыАктивов.Добавить(ВидАктива);
			КонецЦикла;            
			
		КонецЦикла;	
			
		СтрокиИсключения = ИсторияРеестра.НайтиСтроки(Новый Структура("КвалИнвестор, ВидИзменения", Выборка.КвалИнвестор, Перечисления.ВидыИзмененийПеречней.Исключение));
		
		Если СтрокиИсключения.Количество() > 0 Тогда
			
			ВидыАктивов.Очистить();
			Для Каждого СтрокаВключения Из СтрокиВключения Цикл
				ВидыАктивов.Добавить(СтрокаВключения.ВидАктива);
			КонецЦикла;
			
			ВывестиСтроку(ДокументРезультат, ОбластьСтрока, Выборка, СтрокиИсключения[0], ВидыАктивов, НомерСтроки);
			
		КонецЕсли;
		   		
	КонецЦикла;
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
			
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ОбластьПодвал.Параметры.Ответственный = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;		
		ОбластьПодвал.Параметры.ОтветственныйДолжность = СтруктураДанныхКонтактногоЛица.Должность;
				
	КонецЕсли; 
		
	ДокументРезультат.Вывести(ОбластьПодвал);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, СессияСбораСтатистики);
	
КонецПроцедуры

Процедура ВывестиСтроку(ДокументРезультат, ОбластьСтрока, Выборка, СтрокаИстории, ВидыАктивов, НомерСтроки)
	
	ОбластьСтрока.Параметры.Заполнить(Выборка);
	ОбластьСтрока.Параметры.Заполнить(СтрокаИстории);
	ОбластьСтрока.Параметры.ВидыАктивов = СтрСоединить(ВидыАктивов, Символы.ПС);
	ОбластьСтрока.Параметры.НомерСтроки = Формат(НомерСтроки, "ЧГ=0");
	
	НомерСтроки = НомерСтроки + 1;
	
	ДокументРезультат.Вывести(ОбластьСтрока);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	// заполнить, если потребуется
	
КонецПроцедуры
